[
    {
      "property_id": "BF001",
      "title": "Luxury Beachfront Villa",
      "image": "https://i.postimg.cc/JzqbTgXB/pexels-photo-1396132.jpg",
      "Area": "3500 sq ft",
      "beds": 5,
      "baths": 4,
      "floor": 2,
      "garage": 2,
      "added_date": "2024-11-01",
      "location": "Malibu, California",
      "segment_name": "Beachfront",
      "description": "This stunning luxury villa offers unparalleled views of the Pacific Ocean. It features five spacious bedrooms, four bathrooms, and an open-plan living area that seamlessly flows onto the terrace, perfect for entertaining. The master suite boasts panoramic ocean views, a private balcony, and a large walk-in closet. The modern kitchen is equipped with high-end appliances, while the living room opens directly to an expansive deck with a private infinity pool overlooking the beach. With two garage spaces, this property is ideal for those looking to live the ultimate beachfront lifestyle in one of the most prestigious locations in California.",
      "price": "$12,000,000",
      "status": "sale",
      "facilities": ["living room", "swimming pool", "Kitchen", "private beach access", "home office"]
    },
    {
      "property_id": "BF002",
      "title": "Oceanfront Condo with Amazing Views",
      "image": "https://i.postimg.cc/k5gWLcNY/pexels-photo-1268862.jpg",
      "Area": "2000 sq ft",
      "beds": 3,
      "baths": 3,
      "floor": 7,
      "garage": 1,
      "added_date": "2024-11-05",
      "location": "Miami Beach, Florida",
      "segment_name": "Beachfront",
      "description": "This contemporary oceanfront condo in the heart of Miami Beach offers breathtaking views of the Atlantic Ocean. With three bedrooms and three bathrooms, the condo is designed with an open floor plan that maximizes space and light. The modern kitchen is equipped with top-of-the-line appliances, while the spacious living room has floor-to-ceiling windows that provide uninterrupted ocean views. Residents can enjoy the luxury of a private swimming pool, fitness center, and direct beach access. Located within walking distance of the best restaurants and shops, this condo offers the ultimate urban beach lifestyle.",
      "price": "$3,500,000",
      "status": "sale",
      "facilities": ["living room", "swimming pool", "Kitchen", "fitness center", "beach access"]
    },
    {
      "property_id": "BF003",
      "title": "Coastal Paradise Retreat",
      "image": "https://i.postimg.cc/yNp0KZv1/ruhl-house-home-galveston-texas-158148.jpg",
      "Area": "2800 sq ft",
      "beds": 4,
      "baths": 5,
      "floor": 1,
      "garage": 3,
      "added_date": "2024-10-15",
      "location": "Hawaii, USA",
      "segment_name": "Beachfront",
      "description": "Nestled in a serene and private cove in Hawaii, this coastal retreat offers over 2800 square feet of luxurious living space. The home features four bedrooms, five bathrooms, and an expansive living area with ocean views from every angle. The kitchen is a chef's dream, with premium appliances and ample counter space. The property also boasts a large private swimming pool, a hot tub, and an outdoor kitchen, perfect for enjoying the island lifestyle. With direct access to the beach and an array of outdoor recreation options, this property provides the perfect blend of luxury and nature.",
      "price": "$9,800,000",
      "status": "sale",
      "facilities": ["living room", "swimming pool", "Kitchen", "outdoor kitchen", "hot tub"]
    },
    {
      "property_id": "BF004",
      "title": "Modern Beach House with Infinity Pool",
      "image": "https://i.postimg.cc/mDcCgg5Q/pexels-photo-210617.jpg",
      "Area": "3600 sq ft",
      "beds": 6,
      "baths": 4,
      "floor": 2,
      "garage": 2,
      "added_date": "2024-11-10",
      "location": "Santa Monica, California",
      "segment_name": "Beachfront",
      "description": "This sleek modern beach house offers six bedrooms, four bathrooms, and an open-plan design with luxurious finishes. Located in the exclusive Santa Monica neighborhood, this home features an infinity pool with stunning ocean views, a spacious living room with a fireplace, and a gourmet kitchen perfect for entertaining. The master suite includes a private terrace, a spa-like bathroom, and a walk-in closet. With direct access to the beach and a two-car garage, this home is designed to provide the ultimate beachfront experience.",
      "price": "$15,500,000",
      "status": "sale",
      "facilities": ["living room", "swimming pool", "Kitchen", "fireplace", "terrace"]
    },
    {
      "property_id": "BF005",
      "title": "Beachfront Penthouse with Rooftop Deck",
      "image": "https://i.postimg.cc/Ssw82bBH/pexels-photo-280229.jpg",
      "Area": "2200 sq ft",
      "beds": 3,
      "baths": 3,
      "floor": 9,
      "garage": 1,
      "added_date": "2024-11-15",
      "location": "Cancun, Mexico",
      "segment_name": "Beachfront",
      "description": "This luxurious beachfront penthouse offers 2200 square feet of living space with panoramic views of the Caribbean Sea. Featuring three spacious bedrooms and three bathrooms, this penthouse includes an open living and dining area with floor-to-ceiling windows, making it ideal for taking in the stunning surroundings. The kitchen is equipped with the latest appliances, while the master suite includes a private balcony overlooking the ocean. The highlight of the property is the expansive rooftop deck with a hot tub and outdoor lounge area, perfect for enjoying the warm tropical evenings.",
      "price": "$4,200,000",
      "status": "sale",
      "facilities": ["living room", "swimming pool", "Kitchen", "rooftop deck", "hot tub"]
    }
  ]
  