[
    {
      "property_id": "001",
      "title": "Luxury Penthouse with Sea View",
      "image": "https://i.postimg.cc/wxQTspYJ/pexels-photo-3935316.jpg",
      "area": "2500 sq ft",
      "beds": 4,
      "baths": 5,
      "floor": 25,
      "garage": 2,
      "added_date": "2024-11-01",
      "location": "Miami Beach, FL",
      "segment_name": "Luxury",
      "description": "This luxurious penthouse offers stunning views of the Miami coastline, with expansive living spaces and top-tier amenities. The spacious living room features floor-to-ceiling windows, allowing natural light to flood the space, while the modern kitchen is equipped with high-end appliances. The four bedrooms, each with an en-suite bathroom, provide privacy and comfort. Enjoy the private rooftop terrace with a hot tub and seating area perfect for entertaining guests. This penthouse includes access to exclusive building amenities such as a private pool, fitness center, and 24/7 concierge service. A truly exceptional property, perfect for those who desire the ultimate in luxury living.",
      "price": "$5,500,000",
      "status": "sale",
      "facilities": ["living room", "swimming pool", "Kitchen", "fitness center", "rooftop terrace"]
    },
    {
      "property_id": "002",
      "title": "Modern Penthouse in the Heart of New York",
      "image": "https://i.postimg.cc/kXMMQp7H/pexels-photo-6782581.jpg",
      "area": "1800 sq ft",
      "beds": 3,
      "baths": 3,
      "floor": 35,
      "garage": 1,
      "added_date": "2024-11-12",
      "location": "Manhattan, NY",
      "segment_name": "Premium",
      "description": "Situated in the heart of Manhattan, this sleek and modern penthouse offers a blend of urban sophistication and comfort. The open-concept living area boasts a state-of-the-art kitchen with an island, stainless steel appliances, and a breakfast nook. The three spacious bedrooms include custom walk-in closets and luxury en-suite bathrooms with rainfall showers. This penthouse is designed for both relaxation and entertaining, with a private terrace offering sweeping city views, a hot tub, and a barbecue area. Residents also have access to a full-service building with a concierge, gym, and 24-hour security.",
      "price": "$3,200,000",
      "status": "sale",
      "facilities": ["living room", "swimming pool", "Kitchen", "terrace", "gym"]
    },
    {
      "property_id": "003",
      "title": "Elegant Penthouse with Mountain Views",
      "image": "https://i.postimg.cc/rwK8bR0C/pexels-photo-6969866.jpg",
      "area": "2200 sq ft",
      "beds": 5,
      "baths": 4,
      "floor": 18,
      "garage": 2,
      "added_date": "2024-10-22",
      "location": "Denver, CO",
      "segment_name": "Exclusive",
      "description": "This elegant penthouse offers unparalleled mountain views and an open-concept design that maximizes natural light and space. The gourmet kitchen is equipped with premium appliances, a marble island, and custom cabinetry. The five bedrooms are spacious and designed with luxury in mind, featuring oversized windows that allow you to enjoy the mountain vistas. The private terrace is perfect for outdoor dining, and the penthouse also includes a dedicated office space and a fully equipped home theater. The building offers a rooftop pool, a state-of-the-art fitness center, and a 24-hour concierge service.",
      "price": "$4,000,000",
      "status": "sale",
      "facilities": ["living room", "swimming pool", "Kitchen", "home theater", "terrace"]
    },
    {
      "property_id": "004",
      "title": "Luxury Penthouse with Sea View",
      "image": "https://i.postimg.cc/SxFhwq0D/pexels-photo-1396122.jpg",
      "area": "2100 sq ft",
      "beds": 3,
      "baths": 3,
      "floor": 40,
      "garage": 1,
      "added_date": "2024-11-05",
      "location": "Los Angeles, CA",
      "segment_name": "Premium",
      "description": "This contemporary penthouse offers panoramic views of downtown Los Angeles and the Pacific Ocean. Featuring an open-plan design, the living room seamlessly flows into the dining area and modern kitchen with top-of-the-line appliances. The master suite is a private retreat, complete with a walk-in closet, soaking tub, and expansive windows. A large private terrace is ideal for entertaining, and the building offers residents access to a rooftop pool, fitness center, and exclusive lounge area. The location provides easy access to the best shopping, dining, and entertainment Los Angeles has to offer.",
      "price": "$3,800,000",
      "status": "sale",
      "facilities": ["living room", "swimming pool", "Kitchen", "fitness center", "terrace"]
    },
    {
      "property_id": "005",
      "title": "Penthouse with Oceanfront Views",
      "image": "https://i.postimg.cc/431s60Sw/pexels-photo-186077.jpg",
      "area": "3000 sq ft",
      "beds": 6,
      "baths": 5,
      "floor": 30,
      "garage": 3,
      "added_date": "2024-11-18",
      "location": "Chicago, IL",
      "segment_name": "Luxury",
      "description": "This sprawling penthouse offers breathtaking views of the Chicago River and skyline. With six bedrooms, five luxurious bathrooms, and a large living room with a fireplace, this home is perfect for both family living and entertaining. The gourmet kitchen features professional-grade appliances, and the expansive dining room is perfect for hosting guests. The penthouse includes a private elevator, a large media room, and a home office. The building boasts a rooftop garden, an indoor pool, and a gym. Situated in the heart of Chicago, this property offers convenient access to shopping, fine dining, and cultural attractions.",
      "price": "$6,000,000",
      "status": "sale",
      "facilities": ["living room", "swimming pool", "Kitchen", "media room", "rooftop garden"]
    },
    {
      "property_id": "006",
      "title": "Penthouse with Oceanfront Views",
      "image": "https://i.postimg.cc/tTHpYrr2/pexels-photo-7045918.jpg",
      "area": "2800 sq ft",
      "beds": 4,
      "baths": 4,
      "floor": 20,
      "garage": 2,
      "added_date": "2024-11-10",
      "location": "Honolulu, HI",
      "segment_name": "Exclusive",
      "description": "This stunning penthouse offers unrivaled oceanfront views in one of the most sought-after locations in Honolulu. With 2800 sq ft of living space, the penthouse features an expansive living room with floor-to-ceiling windows, allowing you to enjoy the beauty of the Pacific Ocean from every angle. The gourmet kitchen includes top-tier appliances, a large island, and custom cabinetry. The spacious master suite includes a private balcony, while the other three bedrooms are designed for ultimate comfort. Enjoy the exclusive amenities of the building, including an infinity pool, private cabanas, and a fitness center. Ideal for those looking to experience luxury living in paradise.",
      "price": "$7,200,000",
      "status": "sale",
      "facilities": ["living room", "swimming pool", "Kitchen", "fitness center", "balcony"]
    },
    {
        "property_id": "BF001",
        "title": "Luxury Beachfront Villa",
        "image": "https://i.postimg.cc/JzqbTgXB/pexels-photo-1396132.jpg",
        "Area": "3500 sq ft",
        "beds": 5,
        "baths": 4,
        "floor": 2,
        "garage": 2,
        "added_date": "2024-11-01",
        "location": "Malibu, California",
        "segment_name": "Beachfront",
        "description": "This stunning luxury villa offers unparalleled views of the Pacific Ocean. It features five spacious bedrooms, four bathrooms, and an open-plan living area that seamlessly flows onto the terrace, perfect for entertaining. The master suite boasts panoramic ocean views, a private balcony, and a large walk-in closet. The modern kitchen is equipped with high-end appliances, while the living room opens directly to an expansive deck with a private infinity pool overlooking the beach. With two garage spaces, this property is ideal for those looking to live the ultimate beachfront lifestyle in one of the most prestigious locations in California.",
        "price": "$12,000,000",
        "status": "sale",
        "facilities": ["living room", "swimming pool", "Kitchen", "private beach access", "home office"]
      },
      {
        "property_id": "BF002",
        "title": "Oceanfront Condo with Amazing Views",
        "image": "https://i.postimg.cc/k5gWLcNY/pexels-photo-1268862.jpg",
        "Area": "2000 sq ft",
        "beds": 3,
        "baths": 3,
        "floor": 7,
        "garage": 1,
        "added_date": "2024-11-05",
        "location": "Miami Beach, Florida",
        "segment_name": "Beachfront",
        "description": "This contemporary oceanfront condo in the heart of Miami Beach offers breathtaking views of the Atlantic Ocean. With three bedrooms and three bathrooms, the condo is designed with an open floor plan that maximizes space and light. The modern kitchen is equipped with top-of-the-line appliances, while the spacious living room has floor-to-ceiling windows that provide uninterrupted ocean views. Residents can enjoy the luxury of a private swimming pool, fitness center, and direct beach access. Located within walking distance of the best restaurants and shops, this condo offers the ultimate urban beach lifestyle.",
        "price": "$3,500,000",
        "status": "sale",
        "facilities": ["living room", "swimming pool", "Kitchen", "fitness center", "beach access"]
      },
      {
        "property_id": "BF003",
        "title": "Coastal Paradise Retreat",
        "image": "https://i.postimg.cc/yNp0KZv1/ruhl-house-home-galveston-texas-158148.jpg",
        "Area": "2800 sq ft",
        "beds": 4,
        "baths": 5,
        "floor": 1,
        "garage": 3,
        "added_date": "2024-10-15",
        "location": "Hawaii, USA",
        "segment_name": "Beachfront",
        "description": "Nestled in a serene and private cove in Hawaii, this coastal retreat offers over 2800 square feet of luxurious living space. The home features four bedrooms, five bathrooms, and an expansive living area with ocean views from every angle. The kitchen is a chef's dream, with premium appliances and ample counter space. The property also boasts a large private swimming pool, a hot tub, and an outdoor kitchen, perfect for enjoying the island lifestyle. With direct access to the beach and an array of outdoor recreation options, this property provides the perfect blend of luxury and nature.",
        "price": "$9,800,000",
        "status": "sale",
        "facilities": ["living room", "swimming pool", "Kitchen", "outdoor kitchen", "hot tub"]
      },
      {
        "property_id": "BF004",
        "title": "Modern Beach House with Infinity Pool",
        "image": "https://i.postimg.cc/mDcCgg5Q/pexels-photo-210617.jpg",
        "Area": "3600 sq ft",
        "beds": 6,
        "baths": 4,
        "floor": 2,
        "garage": 2,
        "added_date": "2024-11-10",
        "location": "Santa Monica, California",
        "segment_name": "Beachfront",
        "description": "This sleek modern beach house offers six bedrooms, four bathrooms, and an open-plan design with luxurious finishes. Located in the exclusive Santa Monica neighborhood, this home features an infinity pool with stunning ocean views, a spacious living room with a fireplace, and a gourmet kitchen perfect for entertaining. The master suite includes a private terrace, a spa-like bathroom, and a walk-in closet. With direct access to the beach and a two-car garage, this home is designed to provide the ultimate beachfront experience.",
        "price": "$15,500,000",
        "status": "sale",
        "facilities": ["living room", "swimming pool", "Kitchen", "fireplace", "terrace"]
      },
      {
        "property_id": "BF005",
        "title": "Beachfront Penthouse with Rooftop Deck",
        "image": "https://i.postimg.cc/Ssw82bBH/pexels-photo-280229.jpg",
        "Area": "2200 sq ft",
        "beds": 3,
        "baths": 3,
        "floor": 9,
        "garage": 1,
        "added_date": "2024-11-15",
        "location": "Cancun, Mexico",
        "segment_name": "Beachfront",
        "description": "This luxurious beachfront penthouse offers 2200 square feet of living space with panoramic views of the Caribbean Sea. Featuring three spacious bedrooms and three bathrooms, this penthouse includes an open living and dining area with floor-to-ceiling windows, making it ideal for taking in the stunning surroundings. The kitchen is equipped with the latest appliances, while the master suite includes a private balcony overlooking the ocean. The highlight of the property is the expansive rooftop deck with a hot tub and outdoor lounge area, perfect for enjoying the warm tropical evenings.",
        "price": "$4,200,000",
        "status": "sale",
        "facilities": ["living room", "swimming pool", "Kitchen", "rooftop deck", "hot tub"]
      },
      {
        "property_id": "M001",
        "title": "Grand Hilltop Mansion",
        "image": "https://i.postimg.cc/8z55Sn3v/pexels-photo-6957083.jpg",
        "Area": "5000 sq ft",
        "beds": 6,
        "baths": 5,
        "floor": 3,
        "garage": 3,
        "added_date": "2024-11-10",
        "location": "Beverly Hills, California",
        "segment_name": "Luxury",
        "description": "This stunning hilltop mansion is a blend of elegance and sophistication, offering expansive views of the surrounding landscapes. The mansion features a grand entrance, a spacious living room with large windows, a gourmet kitchen with state-of-the-art appliances, and a luxurious master suite with a private balcony. The property is complemented by a sprawling garden, a private pool, and multiple entertainment spaces. Located in the prestigious Beverly Hills area, it offers unparalleled privacy and access to the best amenities in the city.",
        "price": "$25,000,000",
        "status": "sale",
        "facilities": ["living room", "swimming pool", "kitchen", "home theater", "library", "wine cellar"]
      },
      {
        "property_id": "M002",
        "title": "Oceanfront Mansion",
        "image": "https://i.postimg.cc/y8bNYy4b/pexels-photo-8143671.jpg",
        "Area": "7500 sq ft",
        "beds": 8,
        "baths": 7,
        "floor": 4,
        "garage": 4,
        "added_date": "2024-11-15",
        "location": "Malibu, California",
        "segment_name": "Exclusive",
        "description": "This exquisite oceanfront mansion sits on a prime stretch of Malibu coastline, offering panoramic views of the Pacific Ocean. The estate features 8 bedrooms, 7 bathrooms, and 4 luxurious floors designed with modern elegance. The large living spaces include a formal dining room, a gourmet kitchen, and a sunken lounge with floor-to-ceiling windows. The infinity pool and hot tub provide perfect relaxation while enjoying the ocean breeze. Additional features include a home gym, a private theater, and a fully equipped outdoor kitchen.",
        "price": "$35,000,000",
        "status": "sale",
        "facilities": ["living room", "swimming pool", "kitchen", "home gym", "home theater", "outdoor kitchen"]
      },
      {
        "property_id": "M003",
        "title": "Chateau De Luxe",
        "image": "https://i.postimg.cc/nL9hs9nc/pexels-photo-242246.jpg",
        "Area": "9500 sq ft",
        "beds": 10,
        "baths": 9,
        "floor": 5,
        "garage": 5,
        "added_date": "2024-10-25",
        "location": "Paris, France",
        "segment_name": "Luxury",
        "description": "Located in the heart of Paris, this magnificent mansion offers a rare opportunity to own a piece of history. The 5-story estate boasts 10 bedrooms, 9 bathrooms, and expansive living spaces, including a formal dining room, library, and salon. The mansion is built in classic French architectural style, featuring exquisite moldings, high ceilings, and crystal chandeliers. The lower floors include a luxurious spa, an indoor pool, and a private wine cellar. Outside, the landscaped garden provides a serene escape with fountains and outdoor lounges.",
        "price": "€45,000,000",
        "status": "sale",
        "facilities": ["living room", "swimming pool", "kitchen", "library", "home theater", "spa"]
      },
      {
        "property_id": "M004",
        "title": "The Highland Estate",
        "image": "https://i.postimg.cc/sXFD5f2P/pexels-photo-2710554.jpg",
        "Area": "12000 sq ft",
        "beds": 12,
        "baths": 11,
        "floor": 6,
        "garage": 6,
        "added_date": "2024-11-01",
        "location": "Scottsdale, Arizona",
        "segment_name": "Luxury",
        "description": "Situated in the upscale community of Scottsdale, The Highland Estate is a 6-floor mansion that features 12 bedrooms and 11 bathrooms. The property offers an impressive array of amenities, including a state-of-the-art kitchen, a formal dining room, and a large living room with panoramic views. The estate is designed for luxury living with an expansive home theater, a private office, a wine cellar, and a game room. Outdoors, you'll find a large swimming pool, a hot tub, and a fully equipped outdoor kitchen perfect for entertaining.",
        "price": "$40,000,000",
        "status": "sale",
        "facilities": ["living room", "swimming pool", "kitchen", "game room", "wine cellar", "outdoor kitchen"]
      },
      {
        "property_id": "M005",
        "title": "The Palatial Villa",
        "image": "https://i.postimg.cc/1tpRBxgk/pexels-photo-208736.jpg",
        "Area": "11000 sq ft",
        "beds": 9,
        "baths": 8,
        "floor": 4,
        "garage": 4,
        "added_date": "2024-11-05",
        "location": "Dubai, UAE",
        "segment_name": "Ultra-luxury",
        "description": "The Palatial Villa is a rare find in the heart of Dubai, combining modern luxury with traditional Arabian elegance. This stunning 4-floor mansion spans 11,000 sq ft, featuring 9 bedrooms, 8 bathrooms, and multiple entertainment spaces, including a large living room, formal dining area, and media room. The villa is designed with the finest finishes, including marble floors, gold accents, and custom woodwork. The exterior boasts beautifully landscaped gardens, an infinity pool, and an outdoor dining area with breathtaking views of the Dubai skyline.",
        "price": "$60,000,000",
        "status": "sale",
        "facilities": ["living room", "swimming pool", "kitchen", "media room", "outdoor dining", "garden"]
      },
      {
        "property_id": "M006",
        "title": "Royal Crest Mansion",
        "image": "https://i.postimg.cc/VvmfH7nd/free-photo-of-large-villas-surrounded-by-trees.jpg",
        "Area": "10000 sq ft",
        "beds": 10,
        "baths": 9,
        "floor": 5,
        "garage": 4,
        "added_date": "2024-11-20",
        "location": "London, United Kingdom",
        "segment_name": "Prestige",
        "description": "Royal Crest Mansion offers an unparalleled living experience in the heart of London. This magnificent 5-floor estate spans 10,000 sq ft, with 10 luxurious bedrooms, 9 bathrooms, and expansive living areas perfect for both family living and entertaining. The estate features a world-class kitchen, a large dining area, a home theater, and a private study. The outdoor space includes a beautifully manicured garden with a fountain, a heated pool, and an outdoor kitchen for alfresco dining. This mansion is truly a statement of opulence and prestige.",
        "price": "£35,000,000",
        "status": "sale",
        "facilities": ["living room", "swimming pool", "kitchen", "home theater", "study", "garden"]
      },
      {
        "property_id": "PI-001",
        "title": "Exclusive Private Island Escape",
        "image": "https://i.postimg.cc/MTbxRyNx/pexels-photo-12516848.jpg",
        "area": "5000 sq ft",
        "beds": 7,
        "baths": 6,
        "floor": 1,
        "garage": "Yes",
        "added_date": "2024-11-01",
        "location": "Caribbean Sea",
        "segment_name": "Luxury",
        "description": "This stunning private island offers a rare opportunity to own an exclusive slice of paradise in the Caribbean. Featuring a main house with 7 spacious bedrooms, a grand living room, multiple bathrooms, and a state-of-the-art kitchen. The island includes a large private beach, lush tropical gardens, and a full-size swimming pool. The property is equipped with high-end amenities for a luxurious living experience, ensuring both privacy and comfort. Accessible only by private boat, it is the ultimate retreat for those seeking tranquility, luxury, and privacy. Perfect for family vacations or an exclusive resort business.",
        "price": "$45,000,000",
        "status": "sale",
        "facilities": ["living room", "swimming pool", "kitchen", "private beach", "tropical garden"]
      },
      {
        "property_id": "PI-002",
        "title": "Secluded Island Paradise",
        "image": "https://i.postimg.cc/mkL4SPW9/pexels-photo-12877383.jpg",
        "area": "8000 sq ft",
        "beds": 10,
        "baths": 8,
        "floor": 2,
        "garage": "Yes",
        "added_date": "2024-10-15",
        "location": "South Pacific",
        "segment_name": "Exclusive",
        "description": "This private island in the South Pacific offers the utmost luxury and seclusion. The property spans over 8000 sq ft and features 10 beautifully appointed bedrooms and 8 luxurious bathrooms. With multiple living spaces, including an expansive living room, a gourmet kitchen, and a large dining area, this island offers everything needed for a private retreat. The outdoor space is equally stunning, with an infinity pool, a full beach house, and miles of pristine coastline. Ideal for those seeking privacy, serenity, and a bespoke living experience, this is truly a once-in-a-lifetime opportunity.",
        "price": "$62,500,000",
        "status": "sale",
        "facilities": ["living room", "swimming pool", "kitchen", "beach house", "private coastline"]
      },
      {
        "property_id": "PI-003",
        "title": "Tropical Luxury Island",
        "image": "https://i.postimg.cc/yxcfWPbX/pexels-photo-12516856.jpg",
        "area": "6000 sq ft",
        "beds": 5,
        "baths": 5,
        "floor": 1,
        "garage": "Yes",
        "added_date": "2024-09-30",
        "location": "Maldives",
        "segment_name": "Luxury",
        "description": "This pristine private island in the Maldives boasts 6000 sq ft of living space, featuring 5 spacious bedrooms and 5 bathrooms. The property includes an expansive open-plan living room, a gourmet kitchen, and an outdoor dining area perfect for entertaining guests. The island features a stunning infinity pool overlooking the turquoise ocean, a private spa, and exclusive beach access. Whether for personal use or as an upscale vacation rental, this property offers an unmatched tropical lifestyle surrounded by the natural beauty of the Maldives. Ideal for those looking for both luxury and natural surroundings.",
        "price": "$38,000,000",
        "status": "sale",
        "facilities": ["living room", "swimming pool", "kitchen", "spa", "beach access"]
      },
      {
        "property_id": "PI-004",
        "title": "Private Island with Resort Potential",
        "image": "https://i.postimg.cc/qvbGJS7H/pexels-photo-1034804.jpg",
        "area": "12000 sq ft",
        "beds": 12,
        "baths": 10,
        "floor": 2,
        "garage": "Yes",
        "added_date": "2024-08-20",
        "location": "Fiji",
        "segment_name": "Investment",
        "description": "This 12,000 sq ft private island offers a unique investment opportunity with the potential to develop a luxury resort. Featuring 12 well-appointed bedrooms, 10 bathrooms, and multiple living areas, including a large living room and kitchen, the island has ample space for large families or guests. The island features lush landscapes, pristine beaches, and clear waters perfect for water sports. With development potential and access to all modern amenities, this island is an excellent investment for those seeking a profitable resort venture or a luxurious private getaway.",
        "price": "$72,000,000",
        "status": "sale",
        "facilities": ["living room", "swimming pool", "kitchen", "private beach", "water sports"]
      },
      {
        "property_id": "PI-005",
        "title": "Romantic Secluded Island",
        "image": "https://i.postimg.cc/CKRsz7ZB/pexels-photo-3324392.jpg",
        "area": "4000 sq ft",
        "beds": 4,
        "baths": 4,
        "floor": 1,
        "garage": "Yes",
        "added_date": "2024-07-15",
        "location": "Bora Bora",
        "segment_name": "Luxury",
        "description": "This enchanting private island is the perfect retreat for those looking for a romantic getaway. With 4 beautifully designed bedrooms and 4 bathrooms, the island offers everything needed for ultimate relaxation. The open-plan living space includes a living room with panoramic views, a modern kitchen, and an expansive outdoor deck. The property features a private beach with crystal-clear waters, a full-service spa, and a luxurious pool. This is the perfect destination for honeymooners or couples looking to disconnect from the world and indulge in luxury and privacy.",
        "price": "$28,000,000",
        "status": "sale",
        "facilities": ["living room", "swimming pool", "kitchen", "private beach", "spa"]
      },
      {
        "property_id": "PI-006",
        "title": "Luxury Island Estate",
        "image": "https://i.postimg.cc/nLNY7m7d/pexels-photo-8431188.jpg",
        "area": "9500 sq ft",
        "beds": 9,
        "baths": 7,
        "floor": 2,
        "garage": "Yes",
        "added_date": "2024-06-30",
        "location": "Bahamas",
        "segment_name": "Exclusive",
        "description": "This private island estate in the Bahamas offers unparalleled luxury and privacy. With 9500 sq ft of living space, the property features 9 luxurious bedrooms and 7 bathrooms. The main house includes a grand living room, a fully-equipped gourmet kitchen, and an expansive dining area. Outside, the estate offers extensive terraces, an infinity pool, and direct beach access. The island is fully equipped with modern amenities and offers privacy from the mainland, making it ideal for a personal retreat or a high-end vacation rental business. A true gem for those seeking ultimate exclusivity.",
        "price": "$50,000,000",
        "status": "sale",
        "facilities": ["living room", "swimming pool", "kitchen", "private beach", "terraces"]
      },
      {
        "property_id": "R001",
        "title": "Oceanfront Resort Paradise",
        "image": "https://i.postimg.cc/m2VYjJC1/pexels-photo-221457.jpg",
        "area": "5000 sq ft",
        "beds": 8,
        "baths": 7,
        "floor": 3,
        "garage": 2,
        "added_date": "2024-10-15",
        "location": "Malibu, California",
        "segment_name": "Luxury Resorts",
        "description": "Nestled in the heart of Malibu, this breathtaking oceanfront resort offers expansive panoramic views of the Pacific Ocean. Boasting a total of 8 spacious bedrooms, each with en-suite bathrooms, this luxurious property offers a truly unique experience. The resort features a private beach, an infinity pool, and multiple entertainment areas perfect for hosting events or simply relaxing. Guests can enjoy direct access to the beach, a fully equipped gourmet kitchen, and beautifully landscaped gardens. The master suite includes a private balcony and a spa bathroom with ocean views. Whether you're looking for a peaceful retreat or a venue for hosting weddings or corporate events, this resort is an exceptional choice.",
        "price": "$12,000,000",
        "status": "sale",
        "facilities": [
          "living room",
          "swimming pool",
          "kitchen",
          "private beach",
          "spa"
        ]
      },
      {
        "property_id": "R002",
        "title": "Mountain View Luxury Resort",
        "image": "https://i.postimg.cc/mkB9NyrS/pexels-photo-1450361.jpg",
        "area": "4500 sq ft",
        "beds": 6,
        "baths": 5,
        "floor": 2,
        "garage": 3,
        "added_date": "2024-09-20",
        "location": "Aspen, Colorado",
        "segment_name": "Luxury Resorts",
        "description": "Experience a luxurious getaway at the Mountain View Resort, located in the stunning Aspen Valley. This resort features 6 elegant bedrooms, each designed with comfort and style in mind. The property offers a combination of rustic charm and modern luxury, with breathtaking views of the snow-capped mountains. Each of the 5 bathrooms is equipped with top-tier fixtures and finishes. The resort is fully equipped with a state-of-the-art kitchen, a spacious living room with a stone fireplace, and expansive outdoor terraces perfect for entertaining. The resort also offers skiing access right at your doorstep, making it ideal for winter sports enthusiasts. The property’s serene surroundings make it a perfect retreat for families or groups looking for adventure or relaxation in the mountains.",
        "price": "$8,500,000",
        "status": "sale",
        "facilities": [
          "living room",
          "swimming pool",
          "kitchen",
          "ski access",
          "fireplace"
        ]
      },
      {
        "property_id": "R003",
        "title": "Tropical Beach Resort",
        "image": "https://i.postimg.cc/y6yc6tfp/pexels-photo-1628086.jpg",
        "area": "7000 sq ft",
        "beds": 10,
        "baths": 9,
        "floor": 4,
        "garage": 4,
        "added_date": "2024-08-30",
        "location": "Koh Samui, Thailand",
        "segment_name": "Beach Resorts",
        "description": "Set against the backdrop of turquoise waters and lush tropical vegetation, the Tropical Beach Resort in Koh Samui offers an idyllic escape. This expansive property spans 7000 square feet and includes 10 luxurious bedrooms, each with breathtaking views of the ocean. With 9 bathrooms, each equipped with luxury features like jacuzzi bathtubs and rainfall showers, the resort offers guests the utmost comfort. The spacious living areas include a modern kitchen, a large living room, and a dining area that opens to an outdoor terrace with an infinity pool. The resort offers a variety of leisure options, including water sports, private yoga classes, and a fully equipped fitness center. This is an exceptional property that combines relaxation and luxury in a tropical paradise.",
        "price": "$6,500,000",
        "status": "rent",
        "facilities": [
          "living room",
          "swimming pool",
          "kitchen",
          "fitness center",
          "water sports"
        ]
      },
      {
        "property_id": "R004",
        "title": "Desert Oasis Resort",
        "image": "https://i.postimg.cc/025mznFk/pexels-photo-189296.jpg",
        "area": "6000 sq ft",
        "beds": 7,
        "baths": 6,
        "floor": 3,
        "garage": 2,
        "added_date": "2024-07-15",
        "location": "Sedona, Arizona",
        "segment_name": "Desert Resorts",
        "description": "The Desert Oasis Resort is a stunning property located in the heart of Sedona’s desert landscape. This luxurious resort spans 6000 square feet and includes 7 spacious bedrooms and 6 elegantly designed bathrooms, offering unmatched privacy and comfort. The resort features a beautiful desert-themed interior design, combining natural stone elements and modern amenities. Guests can relax by the resort’s private pool, take a guided desert tour, or enjoy the resort's exclusive spa services. The resort’s expansive living areas open up to spectacular views of the surrounding desert and red rock formations, making it the perfect destination for those seeking tranquility and connection with nature.",
        "price": "$9,000,000",
        "status": "sale",
        "facilities": [
          "living room",
          "swimming pool",
          "kitchen",
          "spa",
          "desert tour"
        ]
      },
      {
        "property_id": "R005",
        "title": "Vineyard Resort Retreat",
        "image": "https://i.postimg.cc/J4TXZJCb/pexels-photo-237272.jpg",
        "area": "5500 sq ft",
        "beds": 9,
        "baths": 8,
        "floor": 2,
        "garage": 3,
        "added_date": "2024-06-25",
        "location": "Napa Valley, California",
        "segment_name": "Wine Country Resorts",
        "description": "The Vineyard Resort Retreat offers an exceptional stay in the world-renowned Napa Valley wine country. With 5500 square feet of luxury space, this resort includes 9 exquisite bedrooms, each with scenic vineyard views. The 8 bathrooms are designed with elegant fixtures, and the resort features an open-concept living area that flows seamlessly to outdoor terraces. Guests can enjoy private wine tastings, explore the lush vineyards, and relax by the resort’s infinity pool. The property also includes a fully-equipped kitchen, a wine cellar, and an outdoor dining area. This resort is perfect for wine lovers and anyone looking for a peaceful, luxurious retreat amidst the beauty of Napa Valley.",
        "price": "$7,200,000",
        "status": "sale",
        "facilities": [
          "living room",
          "swimming pool",
          "kitchen",
          "wine cellar",
          "private wine tasting"
        ]
      },
      {
        "property_id": "R006",
        "title": "Island Resort Retreat",
        "image": "https://i.postimg.cc/mgtHwDTK/pexels-photo-338504.jpg",
        "area": "8000 sq ft",
        "beds": 12,
        "baths": 10,
        "floor": 5,
        "garage": 3,
        "added_date": "2024-05-10",
        "location": "Maldives",
        "segment_name": "Island Resorts",
        "description": "Located on a pristine private island in the Maldives, this resort spans 8000 square feet and offers 12 luxurious bedrooms, each with direct beach access. The 10 bathrooms are designed to offer the highest level of comfort, featuring ocean-view tubs and rain showers. The resort includes multiple dining areas, an expansive living room, and a fully-equipped kitchen. Guests can enjoy a variety of activities, including snorkeling, diving, and private island tours. The resort’s private beach is perfect for sunset walks, and the outdoor pool overlooks the crystal-clear ocean. This exclusive resort provides the ultimate tropical getaway for those seeking luxury and privacy in a breathtaking natural setting.",
        "price": "$20,000,000",
        "status": "rent",
        "facilities": [
          "living room",
          "swimming pool",
          "kitchen",
          "private beach",
          "snorkeling"
        ]
      },
      {
        "property_id": "V1001",
        "title": "Luxury Villa in Beverly Hills",
        "image": "https://i.postimg.cc/4db7dH1H/pexels-photo-8134745.jpg",
        "area": "5000 sq ft",
        "beds": 6,
        "baths": 5,
        "floor": 2,
        "garage": 3,
        "added_date": "2024-11-01",
        "location": "Beverly Hills, California",
        "segment_name": "Luxury",
        "description": "This stunning luxury villa in Beverly Hills offers expansive living spaces with a contemporary design. It features six spacious bedrooms, five luxurious bathrooms, and an impressive two-story layout. The villa is equipped with state-of-the-art amenities including a swimming pool, home theater, and a fully-equipped kitchen. The property is situated in a prime location, offering breathtaking views of the city. The landscaped garden and outdoor lounge areas provide an ideal space for entertaining guests or relaxing in privacy. A three-car garage ensures convenience, and the villa’s modern architecture blends perfectly with the surrounding natural beauty.",
        "price": "$12,000,000",
        "status": "sale",
        "facilities": [
          "living room",
          "swimming pool",
          "Kitchen",
          "home theater",
          "garden"
        ]
      },
      {
        "property_id": "V1002",
        "title": "Modern Villa with Ocean View",
        "image": "https://i.postimg.cc/Y2RLBg9J/pexels-photo-8143675.jpg",
        "area": "3500 sq ft",
        "beds": 5,
        "baths": 4,
        "floor": 2,
        "garage": 2,
        "added_date": "2024-11-05",
        "location": "Malibu, California",
        "segment_name": "Contemporary",
        "description": "Nestled in the hills of Malibu, this modern villa offers stunning panoramic ocean views. With five spacious bedrooms and four elegant bathrooms, this home is designed for luxury living. The open-plan living area includes a chef’s kitchen, expansive living room with floor-to-ceiling windows, and a formal dining area. The villa’s outdoor spaces are just as impressive, featuring an infinity-edge pool and jacuzzi overlooking the ocean. A two-car garage, along with additional parking space, ensures convenience. The villa's eco-friendly features and energy-efficient design make it the perfect blend of style and sustainability.",
        "price": "$8,500,000",
        "status": "sale",
        "facilities": [
          "living room",
          "swimming pool",
          "Kitchen",
          "jacuzzi",
          "ocean view"
        ]
      },
      {
        "property_id": "V1003",
        "title": "Elegant Villa in Tuscany",
        "image": "https://i.postimg.cc/Wb4FN3qt/pexels-photo-1438832.jpg",
        "area": "4000 sq ft",
        "beds": 4,
        "baths": 4,
        "floor": 2,
        "garage": 1,
        "added_date": "2024-10-20",
        "location": "Tuscany, Italy",
        "segment_name": "Estate",
        "description": "Located in the heart of Tuscany, this elegant villa blends old-world charm with modern amenities. With four beautifully appointed bedrooms and four en-suite bathrooms, the villa offers both luxury and comfort. The spacious living areas are adorned with antique furnishings and stunning artwork, while the chef’s kitchen is equipped with high-end appliances. Outside, the property is surrounded by vineyards and olive groves, providing complete privacy and breathtaking views of the Tuscan countryside. A large outdoor terrace with a swimming pool and dining area is perfect for entertaining guests.",
        "price": "$6,200,000",
        "status": "sale",
        "facilities": [
          "living room",
          "swimming pool",
          "Kitchen",
          "vineyard",
          "outdoor terrace"
        ]
      },
      {
        "property_id": "V1004",
        "title": "Charming Villa in Provence",
        "image": "https://i.postimg.cc/FHdYSBZ4/pexels-photo-6032280.jpg",
        "area": "3200 sq ft",
        "beds": 5,
        "baths": 3,
        "floor": 1,
        "garage": 2,
        "added_date": "2024-09-15",
        "location": "Provence, France",
        "segment_name": "Classic",
        "description": "This charming villa in the heart of Provence is an idyllic retreat, offering five bedrooms and three bathrooms in a serene rural setting. The open-plan kitchen is perfect for preparing meals using fresh local produce, while the living room with a stone fireplace provides a cozy atmosphere. Outside, the villa is surrounded by beautiful gardens and mature trees, offering peace and privacy. The large pool area with a sun deck is ideal for relaxing, and the villa also includes a two-car garage and plenty of parking space. The village of Provence is just a short drive away, making this villa a perfect blend of countryside living with easy access to nearby amenities.",
        "price": "$3,750,000",
        "status": "sale",
        "facilities": [
          "living room",
          "swimming pool",
          "Kitchen",
          "garden",
          "sun deck"
        ]
      },
      {
        "property_id": "V1005",
        "title": "Spacious Villa in Dubai Hills",
        "image": "https://i.postimg.cc/mgtHwDTK/pexels-photo-338504.jpg",
        "area": "6000 sq ft",
        "beds": 7,
        "baths": 6,
        "floor": 3,
        "garage": 4,
        "added_date": "2024-11-10",
        "location": "Dubai Hills, UAE",
        "segment_name": "Luxury",
        "description": "Located in the prestigious Dubai Hills, this luxurious villa spans over 6000 square feet of living space. The villa features seven large bedrooms, six bathrooms, and expansive open-plan living areas, including a grand living room and a formal dining room. The state-of-the-art kitchen comes with the latest appliances, and the villa also includes a fully-equipped home gym, a private cinema room, and an elevator for easy access across the three floors. The exterior features a massive swimming pool, a landscaped garden, and a spacious patio perfect for outdoor dining and entertaining. The villa also offers a four-car garage and is close to top schools and shopping centers.",
        "price": "$18,500,000",
        "status": "sale",
        "facilities": [
          "living room",
          "swimming pool",
          "Kitchen",
          "home gym",
          "cinema room",
          "garden"
        ]
      },
      {
        "property_id": "V1006",
        "title": "Contemporary Villa in Bali",
        "image": "https://i.postimg.cc/SsW8Mvms/pexels-photo-258154.jpg",
        "area": "3000 sq ft",
        "beds": 4,
        "baths": 4,
        "floor": 2,
        "garage": 1,
        "added_date": "2024-10-05",
        "location": "Bali, Indonesia",
        "segment_name": "Modern",
        "description": "This contemporary villa in Bali combines luxurious design with natural beauty. With four bedrooms and four bathrooms, the villa offers a tranquil escape in a tropical paradise. The open-concept design includes a spacious living room with a modern kitchen and dining area, all of which open to an expansive terrace with views of the lush garden. The villa is surrounded by palm trees and tropical foliage, creating a private and serene environment. The outdoor infinity pool overlooks a tranquil pond, providing the perfect setting for relaxation. The villa also features a one-car garage and is just a short drive from Bali’s top beaches and restaurants.",
        "price": "$4,200,000",
        "status": "sale",
        "facilities": [
          "living room",
          "swimming pool",
          "Kitchen",
          "terrace",
          "tropical garden"
        ]
      }
  ]
  