[
    {
      "property_id": "001",
      "title": "Luxury Penthouse with Sea View",
      "image": "https://i.postimg.cc/wxQTspYJ/pexels-photo-3935316.jpg",
      "area": "2500 sq ft",
      "beds": 4,
      "baths": 5,
      "floor": 25,
      "garage": 2,
      "added_date": "2024-11-01",
      "location": "Miami Beach, FL",
      "segment_name": "Luxury",
      "description": "This luxurious penthouse offers stunning views of the Miami coastline, with expansive living spaces and top-tier amenities. The spacious living room features floor-to-ceiling windows, allowing natural light to flood the space, while the modern kitchen is equipped with high-end appliances. The four bedrooms, each with an en-suite bathroom, provide privacy and comfort. Enjoy the private rooftop terrace with a hot tub and seating area perfect for entertaining guests. This penthouse includes access to exclusive building amenities such as a private pool, fitness center, and 24/7 concierge service. A truly exceptional property, perfect for those who desire the ultimate in luxury living.",
      "price": "$5,500,000",
      "status": "sale",
      "facilities": ["living room", "swimming pool", "Kitchen", "fitness center", "rooftop terrace"]
    },
    {
      "property_id": "002",
      "title": "Modern Penthouse in the Heart of New York",
      "image": "https://i.postimg.cc/kXMMQp7H/pexels-photo-6782581.jpg",
      "area": "1800 sq ft",
      "beds": 3,
      "baths": 3,
      "floor": 35,
      "garage": 1,
      "added_date": "2024-11-12",
      "location": "Manhattan, NY",
      "segment_name": "Premium",
      "description": "Situated in the heart of Manhattan, this sleek and modern penthouse offers a blend of urban sophistication and comfort. The open-concept living area boasts a state-of-the-art kitchen with an island, stainless steel appliances, and a breakfast nook. The three spacious bedrooms include custom walk-in closets and luxury en-suite bathrooms with rainfall showers. This penthouse is designed for both relaxation and entertaining, with a private terrace offering sweeping city views, a hot tub, and a barbecue area. Residents also have access to a full-service building with a concierge, gym, and 24-hour security.",
      "price": "$3,200,000",
      "status": "sale",
      "facilities": ["living room", "swimming pool", "Kitchen", "terrace", "gym"]
    },
    {
      "property_id": "003",
      "title": "Elegant Penthouse with Mountain Views",
      "image": "https://i.postimg.cc/rwK8bR0C/pexels-photo-6969866.jpg",
      "area": "2200 sq ft",
      "beds": 5,
      "baths": 4,
      "floor": 18,
      "garage": 2,
      "added_date": "2024-10-22",
      "location": "Denver, CO",
      "segment_name": "Exclusive",
      "description": "This elegant penthouse offers unparalleled mountain views and an open-concept design that maximizes natural light and space. The gourmet kitchen is equipped with premium appliances, a marble island, and custom cabinetry. The five bedrooms are spacious and designed with luxury in mind, featuring oversized windows that allow you to enjoy the mountain vistas. The private terrace is perfect for outdoor dining, and the penthouse also includes a dedicated office space and a fully equipped home theater. The building offers a rooftop pool, a state-of-the-art fitness center, and a 24-hour concierge service.",
      "price": "$4,000,000",
      "status": "sale",
      "facilities": ["living room", "swimming pool", "Kitchen", "home theater", "terrace"]
    },
    {
      "property_id": "004",
      "title": "Luxury Penthouse with Sea View",
      "image": "https://i.postimg.cc/SxFhwq0D/pexels-photo-1396122.jpg",
      "area": "2100 sq ft",
      "beds": 3,
      "baths": 3,
      "floor": 40,
      "garage": 1,
      "added_date": "2024-11-05",
      "location": "Los Angeles, CA",
      "segment_name": "Premium",
      "description": "This contemporary penthouse offers panoramic views of downtown Los Angeles and the Pacific Ocean. Featuring an open-plan design, the living room seamlessly flows into the dining area and modern kitchen with top-of-the-line appliances. The master suite is a private retreat, complete with a walk-in closet, soaking tub, and expansive windows. A large private terrace is ideal for entertaining, and the building offers residents access to a rooftop pool, fitness center, and exclusive lounge area. The location provides easy access to the best shopping, dining, and entertainment Los Angeles has to offer.",
      "price": "$3,800,000",
      "status": "sale",
      "facilities": ["living room", "swimming pool", "Kitchen", "fitness center", "terrace"]
    },
    {
      "property_id": "005",
      "title": "Penthouse with Oceanfront Views",
      "image": "https://i.postimg.cc/431s60Sw/pexels-photo-186077.jpg",
      "area": "3000 sq ft",
      "beds": 6,
      "baths": 5,
      "floor": 30,
      "garage": 3,
      "added_date": "2024-11-18",
      "location": "Chicago, IL",
      "segment_name": "Luxury",
      "description": "This sprawling penthouse offers breathtaking views of the Chicago River and skyline. With six bedrooms, five luxurious bathrooms, and a large living room with a fireplace, this home is perfect for both family living and entertaining. The gourmet kitchen features professional-grade appliances, and the expansive dining room is perfect for hosting guests. The penthouse includes a private elevator, a large media room, and a home office. The building boasts a rooftop garden, an indoor pool, and a gym. Situated in the heart of Chicago, this property offers convenient access to shopping, fine dining, and cultural attractions.",
      "price": "$6,000,000",
      "status": "sale",
      "facilities": ["living room", "swimming pool", "Kitchen", "media room", "rooftop garden"]
    },
    {
      "property_id": "006",
      "title": "Penthouse with Oceanfront Views",
      "image": "https://i.postimg.cc/tTHpYrr2/pexels-photo-7045918.jpg",
      "area": "2800 sq ft",
      "beds": 4,
      "baths": 4,
      "floor": 20,
      "garage": 2,
      "added_date": "2024-11-10",
      "location": "Honolulu, HI",
      "segment_name": "Exclusive",
      "description": "This stunning penthouse offers unrivaled oceanfront views in one of the most sought-after locations in Honolulu. With 2800 sq ft of living space, the penthouse features an expansive living room with floor-to-ceiling windows, allowing you to enjoy the beauty of the Pacific Ocean from every angle. The gourmet kitchen includes top-tier appliances, a large island, and custom cabinetry. The spacious master suite includes a private balcony, while the other three bedrooms are designed for ultimate comfort. Enjoy the exclusive amenities of the building, including an infinity pool, private cabanas, and a fitness center. Ideal for those looking to experience luxury living in paradise.",
      "price": "$7,200,000",
      "status": "sale",
      "facilities": ["living room", "swimming pool", "Kitchen", "fitness center", "balcony"]
    },
    {
        "property_id": "BF001",
        "title": "Luxury Beachfront Villa",
        "image": "https://i.postimg.cc/JzqbTgXB/pexels-photo-1396132.jpg",
        "Area": "3500 sq ft",
        "beds": 5,
        "baths": 4,
        "floor": 2,
        "garage": 2,
        "added_date": "2024-11-01",
        "location": "Malibu, California",
        "segment_name": "Beachfront",
        "description": "This stunning luxury villa offers unparalleled views of the Pacific Ocean. It features five spacious bedrooms, four bathrooms, and an open-plan living area that seamlessly flows onto the terrace, perfect for entertaining. The master suite boasts panoramic ocean views, a private balcony, and a large walk-in closet. The modern kitchen is equipped with high-end appliances, while the living room opens directly to an expansive deck with a private infinity pool overlooking the beach. With two garage spaces, this property is ideal for those looking to live the ultimate beachfront lifestyle in one of the most prestigious locations in California.",
        "price": "$12,000,000",
        "status": "sale",
        "facilities": ["living room", "swimming pool", "Kitchen", "private beach access", "home office"]
      },
      {
        "property_id": "BF002",
        "title": "Oceanfront Condo with Amazing Views",
        "image": "https://i.postimg.cc/k5gWLcNY/pexels-photo-1268862.jpg",
        "Area": "2000 sq ft",
        "beds": 3,
        "baths": 3,
        "floor": 7,
        "garage": 1,
        "added_date": "2024-11-05",
        "location": "Miami Beach, Florida",
        "segment_name": "Beachfront",
        "description": "This contemporary oceanfront condo in the heart of Miami Beach offers breathtaking views of the Atlantic Ocean. With three bedrooms and three bathrooms, the condo is designed with an open floor plan that maximizes space and light. The modern kitchen is equipped with top-of-the-line appliances, while the spacious living room has floor-to-ceiling windows that provide uninterrupted ocean views. Residents can enjoy the luxury of a private swimming pool, fitness center, and direct beach access. Located within walking distance of the best restaurants and shops, this condo offers the ultimate urban beach lifestyle.",
        "price": "$3,500,000",
        "status": "sale",
        "facilities": ["living room", "swimming pool", "Kitchen", "fitness center", "beach access"]
      },
      {
        "property_id": "BF003",
        "title": "Coastal Paradise Retreat",
        "image": "https://i.postimg.cc/yNp0KZv1/ruhl-house-home-galveston-texas-158148.jpg",
        "Area": "2800 sq ft",
        "beds": 4,
        "baths": 5,
        "floor": 1,
        "garage": 3,
        "added_date": "2024-10-15",
        "location": "Hawaii, USA",
        "segment_name": "Beachfront",
        "description": "Nestled in a serene and private cove in Hawaii, this coastal retreat offers over 2800 square feet of luxurious living space. The home features four bedrooms, five bathrooms, and an expansive living area with ocean views from every angle. The kitchen is a chef's dream, with premium appliances and ample counter space. The property also boasts a large private swimming pool, a hot tub, and an outdoor kitchen, perfect for enjoying the island lifestyle. With direct access to the beach and an array of outdoor recreation options, this property provides the perfect blend of luxury and nature.",
        "price": "$9,800,000",
        "status": "sale",
        "facilities": ["living room", "swimming pool", "Kitchen", "outdoor kitchen", "hot tub"]
      },
      {
        "property_id": "BF004",
        "title": "Modern Beach House with Infinity Pool",
        "image": "https://i.postimg.cc/mDcCgg5Q/pexels-photo-210617.jpg",
        "Area": "3600 sq ft",
        "beds": 6,
        "baths": 4,
        "floor": 2,
        "garage": 2,
        "added_date": "2024-11-10",
        "location": "Santa Monica, California",
        "segment_name": "Beachfront",
        "description": "This sleek modern beach house offers six bedrooms, four bathrooms, and an open-plan design with luxurious finishes. Located in the exclusive Santa Monica neighborhood, this home features an infinity pool with stunning ocean views, a spacious living room with a fireplace, and a gourmet kitchen perfect for entertaining. The master suite includes a private terrace, a spa-like bathroom, and a walk-in closet. With direct access to the beach and a two-car garage, this home is designed to provide the ultimate beachfront experience.",
        "price": "$15,500,000",
        "status": "sale",
        "facilities": ["living room", "swimming pool", "Kitchen", "fireplace", "terrace"]
      },
      {
        "property_id": "BF005",
        "title": "Beachfront Penthouse with Rooftop Deck",
        "image": "https://i.postimg.cc/Ssw82bBH/pexels-photo-280229.jpg",
        "Area": "2200 sq ft",
        "beds": 3,
        "baths": 3,
        "floor": 9,
        "garage": 1,
        "added_date": "2024-11-15",
        "location": "Cancun, Mexico",
        "segment_name": "Beachfront",
        "description": "This luxurious beachfront penthouse offers 2200 square feet of living space with panoramic views of the Caribbean Sea. Featuring three spacious bedrooms and three bathrooms, this penthouse includes an open living and dining area with floor-to-ceiling windows, making it ideal for taking in the stunning surroundings. The kitchen is equipped with the latest appliances, while the master suite includes a private balcony overlooking the ocean. The highlight of the property is the expansive rooftop deck with a hot tub and outdoor lounge area, perfect for enjoying the warm tropical evenings.",
        "price": "$4,200,000",
        "status": "sale",
        "facilities": ["living room", "swimming pool", "Kitchen", "rooftop deck", "hot tub"]
      },
      {
        "property_id": "M001",
        "title": "Grand Hilltop Mansion",
        "image": "https://i.postimg.cc/8z55Sn3v/pexels-photo-6957083.jpg",
        "Area": "5000 sq ft",
        "beds": 6,
        "baths": 5,
        "floor": 3,
        "garage": 3,
        "added_date": "2024-11-10",
        "location": "Beverly Hills, California",
        "segment_name": "Luxury",
        "description": "This stunning hilltop mansion is a blend of elegance and sophistication, offering expansive views of the surrounding landscapes. The mansion features a grand entrance, a spacious living room with large windows, a gourmet kitchen with state-of-the-art appliances, and a luxurious master suite with a private balcony. The property is complemented by a sprawling garden, a private pool, and multiple entertainment spaces. Located in the prestigious Beverly Hills area, it offers unparalleled privacy and access to the best amenities in the city.",
        "price": "$25,000,000",
        "status": "sale",
        "facilities": ["living room", "swimming pool", "kitchen", "home theater", "library", "wine cellar"]
      },
      {
        "property_id": "M002",
        "title": "Oceanfront Mansion",
        "image": "https://i.postimg.cc/y8bNYy4b/pexels-photo-8143671.jpg",
        "Area": "7500 sq ft",
        "beds": 8,
        "baths": 7,
        "floor": 4,
        "garage": 4,
        "added_date": "2024-11-15",
        "location": "Malibu, California",
        "segment_name": "Exclusive",
        "description": "This exquisite oceanfront mansion sits on a prime stretch of Malibu coastline, offering panoramic views of the Pacific Ocean. The estate features 8 bedrooms, 7 bathrooms, and 4 luxurious floors designed with modern elegance. The large living spaces include a formal dining room, a gourmet kitchen, and a sunken lounge with floor-to-ceiling windows. The infinity pool and hot tub provide perfect relaxation while enjoying the ocean breeze. Additional features include a home gym, a private theater, and a fully equipped outdoor kitchen.",
        "price": "$35,000,000",
        "status": "sale",
        "facilities": ["living room", "swimming pool", "kitchen", "home gym", "home theater", "outdoor kitchen"]
      },
      {
        "property_id": "M003",
        "title": "Chateau De Luxe",
        "image": "https://i.postimg.cc/nL9hs9nc/pexels-photo-242246.jpg",
        "Area": "9500 sq ft",
        "beds": 10,
        "baths": 9,
        "floor": 5,
        "garage": 5,
        "added_date": "2024-10-25",
        "location": "Paris, France",
        "segment_name": "Luxury",
        "description": "Located in the heart of Paris, this magnificent mansion offers a rare opportunity to own a piece of history. The 5-story estate boasts 10 bedrooms, 9 bathrooms, and expansive living spaces, including a formal dining room, library, and salon. The mansion is built in classic French architectural style, featuring exquisite moldings, high ceilings, and crystal chandeliers. The lower floors include a luxurious spa, an indoor pool, and a private wine cellar. Outside, the landscaped garden provides a serene escape with fountains and outdoor lounges.",
        "price": "€45,000,000",
        "status": "sale",
        "facilities": ["living room", "swimming pool", "kitchen", "library", "home theater", "spa"]
      },
      {
        "property_id": "M004",
        "title": "The Highland Estate",
        "image": "https://i.postimg.cc/sXFD5f2P/pexels-photo-2710554.jpg",
        "Area": "12000 sq ft",
        "beds": 12,
        "baths": 11,
        "floor": 6,
        "garage": 6,
        "added_date": "2024-11-01",
        "location": "Scottsdale, Arizona",
        "segment_name": "Luxury",
        "description": "Situated in the upscale community of Scottsdale, The Highland Estate is a 6-floor mansion that features 12 bedrooms and 11 bathrooms. The property offers an impressive array of amenities, including a state-of-the-art kitchen, a formal dining room, and a large living room with panoramic views. The estate is designed for luxury living with an expansive home theater, a private office, a wine cellar, and a game room. Outdoors, you'll find a large swimming pool, a hot tub, and a fully equipped outdoor kitchen perfect for entertaining.",
        "price": "$40,000,000",
        "status": "sale",
        "facilities": ["living room", "swimming pool", "kitchen", "game room", "wine cellar", "outdoor kitchen"]
      },
      {
        "property_id": "M005",
        "title": "The Palatial Villa",
        "image": "https://i.postimg.cc/1tpRBxgk/pexels-photo-208736.jpg",
        "Area": "11000 sq ft",
        "beds": 9,
        "baths": 8,
        "floor": 4,
        "garage": 4,
        "added_date": "2024-11-05",
        "location": "Dubai, UAE",
        "segment_name": "Ultra-luxury",
        "description": "The Palatial Villa is a rare find in the heart of Dubai, combining modern luxury with traditional Arabian elegance. This stunning 4-floor mansion spans 11,000 sq ft, featuring 9 bedrooms, 8 bathrooms, and multiple entertainment spaces, including a large living room, formal dining area, and media room. The villa is designed with the finest finishes, including marble floors, gold accents, and custom woodwork. The exterior boasts beautifully landscaped gardens, an infinity pool, and an outdoor dining area with breathtaking views of the Dubai skyline.",
        "price": "$60,000,000",
        "status": "sale",
        "facilities": ["living room", "swimming pool", "kitchen", "media room", "outdoor dining", "garden"]
      },
      {
        "property_id": "M006",
        "title": "Royal Crest Mansion",
        "image": "https://i.postimg.cc/VvmfH7nd/free-photo-of-large-villas-surrounded-by-trees.jpg",
        "Area": "10000 sq ft",
        "beds": 10,
        "baths": 9,
        "floor": 5,
        "garage": 4,
        "added_date": "2024-11-20",
        "location": "London, United Kingdom",
        "segment_name": "Prestige",
        "description": "Royal Crest Mansion offers an unparalleled living experience in the heart of London. This magnificent 5-floor estate spans 10,000 sq ft, with 10 luxurious bedrooms, 9 bathrooms, and expansive living areas perfect for both family living and entertaining. The estate features a world-class kitchen, a large dining area, a home theater, and a private study. The outdoor space includes a beautifully manicured garden with a fountain, a heated pool, and an outdoor kitchen for alfresco dining. This mansion is truly a statement of opulence and prestige.",
        "price": "£35,000,000",
        "status": "sale",
        "facilities": ["living room", "swimming pool", "kitchen", "home theater", "study", "garden"]
      }
  ]
  