[
    {
      "property_id": "001",
      "title": "Luxury Penthouse with Sea View",
      "image": "https://i.postimg.cc/wxQTspYJ/pexels-photo-3935316.jpg",
      "area": "2500 sq ft",
      "beds": 4,
      "baths": 5,
      "floor": 25,
      "garage": 2,
      "added_date": "2024-11-01",
      "location": "Miami Beach, FL",
      "segment_name": "Luxury",
      "description": "This luxurious penthouse offers stunning views of the Miami coastline, with expansive living spaces and top-tier amenities. The spacious living room features floor-to-ceiling windows, allowing natural light to flood the space, while the modern kitchen is equipped with high-end appliances. The four bedrooms, each with an en-suite bathroom, provide privacy and comfort. Enjoy the private rooftop terrace with a hot tub and seating area perfect for entertaining guests. This penthouse includes access to exclusive building amenities such as a private pool, fitness center, and 24/7 concierge service. A truly exceptional property, perfect for those who desire the ultimate in luxury living.",
      "price": "$5,500,000",
      "status": "sale",
      "facilities": ["living room", "swimming pool", "Kitchen", "fitness center", "rooftop terrace"]
    },
    {
      "property_id": "002",
      "title": "Modern Penthouse in the Heart of New York",
      "image": "https://i.postimg.cc/kXMMQp7H/pexels-photo-6782581.jpg",
      "area": "1800 sq ft",
      "beds": 3,
      "baths": 3,
      "floor": 35,
      "garage": 1,
      "added_date": "2024-11-12",
      "location": "Manhattan, NY",
      "segment_name": "Premium",
      "description": "Situated in the heart of Manhattan, this sleek and modern penthouse offers a blend of urban sophistication and comfort. The open-concept living area boasts a state-of-the-art kitchen with an island, stainless steel appliances, and a breakfast nook. The three spacious bedrooms include custom walk-in closets and luxury en-suite bathrooms with rainfall showers. This penthouse is designed for both relaxation and entertaining, with a private terrace offering sweeping city views, a hot tub, and a barbecue area. Residents also have access to a full-service building with a concierge, gym, and 24-hour security.",
      "price": "$3,200,000",
      "status": "sale",
      "facilities": ["living room", "swimming pool", "Kitchen", "terrace", "gym"]
    },
    {
      "property_id": "003",
      "title": "Elegant Penthouse with Mountain Views",
      "image": "https://i.postimg.cc/rwK8bR0C/pexels-photo-6969866.jpg",
      "area": "2200 sq ft",
      "beds": 5,
      "baths": 4,
      "floor": 18,
      "garage": 2,
      "added_date": "2024-10-22",
      "location": "Denver, CO",
      "segment_name": "Exclusive",
      "description": "This elegant penthouse offers unparalleled mountain views and an open-concept design that maximizes natural light and space. The gourmet kitchen is equipped with premium appliances, a marble island, and custom cabinetry. The five bedrooms are spacious and designed with luxury in mind, featuring oversized windows that allow you to enjoy the mountain vistas. The private terrace is perfect for outdoor dining, and the penthouse also includes a dedicated office space and a fully equipped home theater. The building offers a rooftop pool, a state-of-the-art fitness center, and a 24-hour concierge service.",
      "price": "$4,000,000",
      "status": "sale",
      "facilities": ["living room", "swimming pool", "Kitchen", "home theater", "terrace"]
    },
    {
      "property_id": "004",
      "title": "Luxury Penthouse with Sea View",
      "image": "https://i.postimg.cc/SxFhwq0D/pexels-photo-1396122.jpg",
      "area": "2100 sq ft",
      "beds": 3,
      "baths": 3,
      "floor": 40,
      "garage": 1,
      "added_date": "2024-11-05",
      "location": "Los Angeles, CA",
      "segment_name": "Premium",
      "description": "This contemporary penthouse offers panoramic views of downtown Los Angeles and the Pacific Ocean. Featuring an open-plan design, the living room seamlessly flows into the dining area and modern kitchen with top-of-the-line appliances. The master suite is a private retreat, complete with a walk-in closet, soaking tub, and expansive windows. A large private terrace is ideal for entertaining, and the building offers residents access to a rooftop pool, fitness center, and exclusive lounge area. The location provides easy access to the best shopping, dining, and entertainment Los Angeles has to offer.",
      "price": "$3,800,000",
      "status": "sale",
      "facilities": ["living room", "swimming pool", "Kitchen", "fitness center", "terrace"]
    },
    {
      "property_id": "005",
      "title": "Penthouse with Oceanfront Views",
      "image": "https://i.postimg.cc/431s60Sw/pexels-photo-186077.jpg",
      "area": "3000 sq ft",
      "beds": 6,
      "baths": 5,
      "floor": 30,
      "garage": 3,
      "added_date": "2024-11-18",
      "location": "Chicago, IL",
      "segment_name": "Luxury",
      "description": "This sprawling penthouse offers breathtaking views of the Chicago River and skyline. With six bedrooms, five luxurious bathrooms, and a large living room with a fireplace, this home is perfect for both family living and entertaining. The gourmet kitchen features professional-grade appliances, and the expansive dining room is perfect for hosting guests. The penthouse includes a private elevator, a large media room, and a home office. The building boasts a rooftop garden, an indoor pool, and a gym. Situated in the heart of Chicago, this property offers convenient access to shopping, fine dining, and cultural attractions.",
      "price": "$6,000,000",
      "status": "sale",
      "facilities": ["living room", "swimming pool", "Kitchen", "media room", "rooftop garden"]
    },
    {
      "property_id": "006",
      "title": "Penthouse with Oceanfront Views",
      "image": "https://i.postimg.cc/tTHpYrr2/pexels-photo-7045918.jpg",
      "area": "2800 sq ft",
      "beds": 4,
      "baths": 4,
      "floor": 20,
      "garage": 2,
      "added_date": "2024-11-10",
      "location": "Honolulu, HI",
      "segment_name": "Exclusive",
      "description": "This stunning penthouse offers unrivaled oceanfront views in one of the most sought-after locations in Honolulu. With 2800 sq ft of living space, the penthouse features an expansive living room with floor-to-ceiling windows, allowing you to enjoy the beauty of the Pacific Ocean from every angle. The gourmet kitchen includes top-tier appliances, a large island, and custom cabinetry. The spacious master suite includes a private balcony, while the other three bedrooms are designed for ultimate comfort. Enjoy the exclusive amenities of the building, including an infinity pool, private cabanas, and a fitness center. Ideal for those looking to experience luxury living in paradise.",
      "price": "$7,200,000",
      "status": "sale",
      "facilities": ["living room", "swimming pool", "Kitchen", "fitness center", "balcony"]
    }
  ]
  