[
    {
      "property_id": "PI-001",
      "title": "Exclusive Private Island Escape",
      "image": "https://i.postimg.cc/MTbxRyNx/pexels-photo-12516848.jpg",
      "area": "5000 sq ft",
      "beds": 7,
      "baths": 6,
      "floor": 1,
      "garage": "Yes",
      "added_date": "2024-11-01",
      "location": "Caribbean Sea",
      "segment_name": "Luxury",
      "description": "This stunning private island offers a rare opportunity to own an exclusive slice of paradise in the Caribbean. Featuring a main house with 7 spacious bedrooms, a grand living room, multiple bathrooms, and a state-of-the-art kitchen. The island includes a large private beach, lush tropical gardens, and a full-size swimming pool. The property is equipped with high-end amenities for a luxurious living experience, ensuring both privacy and comfort. Accessible only by private boat, it is the ultimate retreat for those seeking tranquility, luxury, and privacy. Perfect for family vacations or an exclusive resort business.",
      "price": "$45,000,000",
      "status": "sale",
      "facilities": ["living room", "swimming pool", "kitchen", "private beach", "tropical garden"]
    },
    {
      "property_id": "PI-002",
      "title": "Secluded Island Paradise",
      "image": "https://i.postimg.cc/mkL4SPW9/pexels-photo-12877383.jpg",
      "area": "8000 sq ft",
      "beds": 10,
      "baths": 8,
      "floor": 2,
      "garage": "Yes",
      "added_date": "2024-10-15",
      "location": "South Pacific",
      "segment_name": "Exclusive",
      "description": "This private island in the South Pacific offers the utmost luxury and seclusion. The property spans over 8000 sq ft and features 10 beautifully appointed bedrooms and 8 luxurious bathrooms. With multiple living spaces, including an expansive living room, a gourmet kitchen, and a large dining area, this island offers everything needed for a private retreat. The outdoor space is equally stunning, with an infinity pool, a full beach house, and miles of pristine coastline. Ideal for those seeking privacy, serenity, and a bespoke living experience, this is truly a once-in-a-lifetime opportunity.",
      "price": "$62,500,000",
      "status": "sale",
      "facilities": ["living room", "swimming pool", "kitchen", "beach house", "private coastline"]
    },
    {
      "property_id": "PI-003",
      "title": "Tropical Luxury Island",
      "image": "https://i.postimg.cc/yxcfWPbX/pexels-photo-12516856.jpg",
      "area": "6000 sq ft",
      "beds": 5,
      "baths": 5,
      "floor": 1,
      "garage": "Yes",
      "added_date": "2024-09-30",
      "location": "Maldives",
      "segment_name": "Luxury",
      "description": "This pristine private island in the Maldives boasts 6000 sq ft of living space, featuring 5 spacious bedrooms and 5 bathrooms. The property includes an expansive open-plan living room, a gourmet kitchen, and an outdoor dining area perfect for entertaining guests. The island features a stunning infinity pool overlooking the turquoise ocean, a private spa, and exclusive beach access. Whether for personal use or as an upscale vacation rental, this property offers an unmatched tropical lifestyle surrounded by the natural beauty of the Maldives. Ideal for those looking for both luxury and natural surroundings.",
      "price": "$38,000,000",
      "status": "sale",
      "facilities": ["living room", "swimming pool", "kitchen", "spa", "beach access"]
    },
    {
      "property_id": "PI-004",
      "title": "Private Island with Resort Potential",
      "image": "https://i.postimg.cc/qvbGJS7H/pexels-photo-1034804.jpg",
      "area": "12000 sq ft",
      "beds": 12,
      "baths": 10,
      "floor": 2,
      "garage": "Yes",
      "added_date": "2024-08-20",
      "location": "Fiji",
      "segment_name": "Investment",
      "description": "This 12,000 sq ft private island offers a unique investment opportunity with the potential to develop a luxury resort. Featuring 12 well-appointed bedrooms, 10 bathrooms, and multiple living areas, including a large living room and kitchen, the island has ample space for large families or guests. The island features lush landscapes, pristine beaches, and clear waters perfect for water sports. With development potential and access to all modern amenities, this island is an excellent investment for those seeking a profitable resort venture or a luxurious private getaway.",
      "price": "$72,000,000",
      "status": "sale",
      "facilities": ["living room", "swimming pool", "kitchen", "private beach", "water sports"]
    },
    {
      "property_id": "PI-005",
      "title": "Romantic Secluded Island",
      "image": "https://i.postimg.cc/CKRsz7ZB/pexels-photo-3324392.jpg",
      "area": "4000 sq ft",
      "beds": 4,
      "baths": 4,
      "floor": 1,
      "garage": "Yes",
      "added_date": "2024-07-15",
      "location": "Bora Bora",
      "segment_name": "Luxury",
      "description": "This enchanting private island is the perfect retreat for those looking for a romantic getaway. With 4 beautifully designed bedrooms and 4 bathrooms, the island offers everything needed for ultimate relaxation. The open-plan living space includes a living room with panoramic views, a modern kitchen, and an expansive outdoor deck. The property features a private beach with crystal-clear waters, a full-service spa, and a luxurious pool. This is the perfect destination for honeymooners or couples looking to disconnect from the world and indulge in luxury and privacy.",
      "price": "$28,000,000",
      "status": "sale",
      "facilities": ["living room", "swimming pool", "kitchen", "private beach", "spa"]
    },
    {
      "property_id": "PI-006",
      "title": "Luxury Island Estate",
      "image": "https://i.postimg.cc/nLNY7m7d/pexels-photo-8431188.jpg",
      "area": "9500 sq ft",
      "beds": 9,
      "baths": 7,
      "floor": 2,
      "garage": "Yes",
      "added_date": "2024-06-30",
      "location": "Bahamas",
      "segment_name": "Exclusive",
      "description": "This private island estate in the Bahamas offers unparalleled luxury and privacy. With 9500 sq ft of living space, the property features 9 luxurious bedrooms and 7 bathrooms. The main house includes a grand living room, a fully-equipped gourmet kitchen, and an expansive dining area. Outside, the estate offers extensive terraces, an infinity pool, and direct beach access. The island is fully equipped with modern amenities and offers privacy from the mainland, making it ideal for a personal retreat or a high-end vacation rental business. A true gem for those seeking ultimate exclusivity.",
      "price": "$50,000,000",
      "status": "sale",
      "facilities": ["living room", "swimming pool", "kitchen", "private beach", "terraces"]
    }
  ]
  