[
    {
      "property_id": "R001",
      "title": "Oceanfront Resort Paradise",
      "image": "https://i.postimg.cc/m2VYjJC1/pexels-photo-221457.jpg",
      "area": "5000 sq ft",
      "beds": 8,
      "baths": 7,
      "floor": 3,
      "garage": 2,
      "added_date": "2024-10-15",
      "location": "Malibu, California",
      "segment_name": "Luxury Resorts",
      "description": "Nestled in the heart of Malibu, this breathtaking oceanfront resort offers expansive panoramic views of the Pacific Ocean. Boasting a total of 8 spacious bedrooms, each with en-suite bathrooms, this luxurious property offers a truly unique experience. The resort features a private beach, an infinity pool, and multiple entertainment areas perfect for hosting events or simply relaxing. Guests can enjoy direct access to the beach, a fully equipped gourmet kitchen, and beautifully landscaped gardens. The master suite includes a private balcony and a spa bathroom with ocean views. Whether you're looking for a peaceful retreat or a venue for hosting weddings or corporate events, this resort is an exceptional choice.",
      "price": "$12,000,000",
      "status": "sale",
      "facilities": [
        "living room",
        "swimming pool",
        "kitchen",
        "private beach",
        "spa"
      ]
    },
    {
      "property_id": "R002",
      "title": "Mountain View Luxury Resort",
      "image": "https://i.postimg.cc/mkB9NyrS/pexels-photo-1450361.jpg",
      "area": "4500 sq ft",
      "beds": 6,
      "baths": 5,
      "floor": 2,
      "garage": 3,
      "added_date": "2024-09-20",
      "location": "Aspen, Colorado",
      "segment_name": "Luxury Resorts",
      "description": "Experience a luxurious getaway at the Mountain View Resort, located in the stunning Aspen Valley. This resort features 6 elegant bedrooms, each designed with comfort and style in mind. The property offers a combination of rustic charm and modern luxury, with breathtaking views of the snow-capped mountains. Each of the 5 bathrooms is equipped with top-tier fixtures and finishes. The resort is fully equipped with a state-of-the-art kitchen, a spacious living room with a stone fireplace, and expansive outdoor terraces perfect for entertaining. The resort also offers skiing access right at your doorstep, making it ideal for winter sports enthusiasts. The property’s serene surroundings make it a perfect retreat for families or groups looking for adventure or relaxation in the mountains.",
      "price": "$8,500,000",
      "status": "sale",
      "facilities": [
        "living room",
        "swimming pool",
        "kitchen",
        "ski access",
        "fireplace"
      ]
    },
    {
      "property_id": "R003",
      "title": "Tropical Beach Resort",
      "image": "https://i.postimg.cc/y6yc6tfp/pexels-photo-1628086.jpg",
      "area": "7000 sq ft",
      "beds": 10,
      "baths": 9,
      "floor": 4,
      "garage": 4,
      "added_date": "2024-08-30",
      "location": "Koh Samui, Thailand",
      "segment_name": "Beach Resorts",
      "description": "Set against the backdrop of turquoise waters and lush tropical vegetation, the Tropical Beach Resort in Koh Samui offers an idyllic escape. This expansive property spans 7000 square feet and includes 10 luxurious bedrooms, each with breathtaking views of the ocean. With 9 bathrooms, each equipped with luxury features like jacuzzi bathtubs and rainfall showers, the resort offers guests the utmost comfort. The spacious living areas include a modern kitchen, a large living room, and a dining area that opens to an outdoor terrace with an infinity pool. The resort offers a variety of leisure options, including water sports, private yoga classes, and a fully equipped fitness center. This is an exceptional property that combines relaxation and luxury in a tropical paradise.",
      "price": "$6,500,000",
      "status": "rent",
      "facilities": [
        "living room",
        "swimming pool",
        "kitchen",
        "fitness center",
        "water sports"
      ]
    },
    {
      "property_id": "R004",
      "title": "Desert Oasis Resort",
      "image": "https://i.postimg.cc/025mznFk/pexels-photo-189296.jpg",
      "area": "6000 sq ft",
      "beds": 7,
      "baths": 6,
      "floor": 3,
      "garage": 2,
      "added_date": "2024-07-15",
      "location": "Sedona, Arizona",
      "segment_name": "Desert Resorts",
      "description": "The Desert Oasis Resort is a stunning property located in the heart of Sedona’s desert landscape. This luxurious resort spans 6000 square feet and includes 7 spacious bedrooms and 6 elegantly designed bathrooms, offering unmatched privacy and comfort. The resort features a beautiful desert-themed interior design, combining natural stone elements and modern amenities. Guests can relax by the resort’s private pool, take a guided desert tour, or enjoy the resort's exclusive spa services. The resort’s expansive living areas open up to spectacular views of the surrounding desert and red rock formations, making it the perfect destination for those seeking tranquility and connection with nature.",
      "price": "$9,000,000",
      "status": "sale",
      "facilities": [
        "living room",
        "swimming pool",
        "kitchen",
        "spa",
        "desert tour"
      ]
    },
    {
      "property_id": "R005",
      "title": "Vineyard Resort Retreat",
      "image": "https://i.postimg.cc/J4TXZJCb/pexels-photo-237272.jpg",
      "area": "5500 sq ft",
      "beds": 9,
      "baths": 8,
      "floor": 2,
      "garage": 3,
      "added_date": "2024-06-25",
      "location": "Napa Valley, California",
      "segment_name": "Wine Country Resorts",
      "description": "The Vineyard Resort Retreat offers an exceptional stay in the world-renowned Napa Valley wine country. With 5500 square feet of luxury space, this resort includes 9 exquisite bedrooms, each with scenic vineyard views. The 8 bathrooms are designed with elegant fixtures, and the resort features an open-concept living area that flows seamlessly to outdoor terraces. Guests can enjoy private wine tastings, explore the lush vineyards, and relax by the resort’s infinity pool. The property also includes a fully-equipped kitchen, a wine cellar, and an outdoor dining area. This resort is perfect for wine lovers and anyone looking for a peaceful, luxurious retreat amidst the beauty of Napa Valley.",
      "price": "$7,200,000",
      "status": "sale",
      "facilities": [
        "living room",
        "swimming pool",
        "kitchen",
        "wine cellar",
        "private wine tasting"
      ]
    },
    {
      "property_id": "R006",
      "title": "Island Resort Retreat",
      "image": "https://i.postimg.cc/mgtHwDTK/pexels-photo-338504.jpg",
      "area": "8000 sq ft",
      "beds": 12,
      "baths": 10,
      "floor": 5,
      "garage": 3,
      "added_date": "2024-05-10",
      "location": "Maldives",
      "segment_name": "Island Resorts",
      "description": "Located on a pristine private island in the Maldives, this resort spans 8000 square feet and offers 12 luxurious bedrooms, each with direct beach access. The 10 bathrooms are designed to offer the highest level of comfort, featuring ocean-view tubs and rain showers. The resort includes multiple dining areas, an expansive living room, and a fully-equipped kitchen. Guests can enjoy a variety of activities, including snorkeling, diving, and private island tours. The resort’s private beach is perfect for sunset walks, and the outdoor pool overlooks the crystal-clear ocean. This exclusive resort provides the ultimate tropical getaway for those seeking luxury and privacy in a breathtaking natural setting.",
      "price": "$20,000,000",
      "status": "rent",
      "facilities": [
        "living room",
        "swimming pool",
        "kitchen",
        "private beach",
        "snorkeling"
      ]
    }
  ]
  